{
    "LocalArticles": [
        {
            "title": "Okanagan wildfires: Cool conditions helping ease concerns",
            "image": "Cool weather for the past three days have helped ease wildfire concerns in B.C.’s Southern Interior.",
            "imageDescription": "Cool weather aiding wildfire suppression efforts in B.C.",
            "author": "dpotenteau",
            "puplisher": "Global News",
            "link": "https://globalnews.ca/news/10648089/okanagan-wildfires-updates-july-27-2024/",
            "date": "2024-07-27",
            "content": {
              "paragraphs": [
                "Cool weather for the past three days have helped ease wildfire concerns in B.C.’s Southern Interior.",
                "“Fire weather indices have decreased due to rainfall and cooler temperatures in many parts of the province, reducing fire behaviour on some of our major incidents,” BC Wildfire said on Saturday.",
                "“Cool and showery conditions are expected for the western half of the province late tomorrow, reaching parts of the Interior as well.",
                "Winds are light, allowing for wildfire smoke to settle in particularly the Southern Interior and Kootenays.”",
                "In the Kamloops Fire Centre, there are currently 78 active wildfires, with 48 listed as being out of control."
                ]
            }
        },
        {
            "title": "Okanagan’s first wildfire holds steady overnight",
            "image" :"The Spring Lake wildfire located approximately 4.5 kilometres west of Peachland.",
            "author": "Ron Seymour",
            "puplisher": "Penticton Herald",
            "link": "https://www.pentictonherald.ca/news/article_f3b12426-3fbc-11ef-817d-df2b21c168e0.html",
            "date": "Jul 11, 2024",
            "content": {
              "paragraphs": [
                "The first significant wildfire this summer in the Okanagan generated lots of smoke but posed no immediate threat, officials said Thursday.",
                "Six aircraft were dispatched to the fire west of Peachland late Wednesday afternoon. By nightfall, when air operations ceased, the fire was measured at 2.2 ha.",
                "It did not spread overnight and the nearest structures were more than four kilometres away. No evacuation alerts were issued. The fire was burning on Crown land near Spring Lake.",
                "Thirty-two ground personnel were working the fire and skimmers and a helicopter were expected to rejoin containment efforts later Thursday morning, said Cassidy Martin, a fire information officer with the BC Wildfire service.",
                "Smoke generated by the fire was visible as far away as Kelowna to the north and Penticton to the south. It was the first significant sign of wildfire this summer in the Okanagan, as cooler conditions in the spring helped damp down the fire threat.",
                "The fire is the only one currently burning and listed as out-of-control in the Kamloops Fire Zone, which encompasses the Okanagan and much of the B.C. Southern Interior. Most current fires are in the far northeast corner of B.C.",
                "An initial assessment by the BCWS was that the fire may have been caused by dry lightning, which can develop without significant or any rainfall when the air temperature is hot and the relative humidity and dew point are low.",
                "However, later the cause was later reclassified as ‘human caused.’"
              ]
            }
        },
        {
            "title": "Several structures destroyed as B.C. wildfires grow",
            "image": "The Aylwin Creek wildfire burns near Slocan, B.C., in a July 18, 2024, handout photo.",
            "imageDescription": "The Aylwin Creek wildfire burns near Slocan, B.C.",
            "author": "CBC News",
            "puplisher": "CBC",
            "link": "https://www.cbc.ca/news/canada/british-columbia/wildfires-july-19-2024-ashcroft-shetland-1.7269382",
            "date": "2024-07-19",
            "content": {
              "paragraphs": [
                "Several structures have been destroyed and thousands of people in B.C.'s Interior have been placed on evacuation alert, as the number of active wildfires continues to grow.",
                "The number of fires that are 'highly visible or pose a potential threat to public safety' in the province has also tripled, according to the B.C. Wildfire Service (BCWS).",
                "All three blazes — the Shetland Creek fire, the Aylwin Creek fire and the Komonko Creek fire — are located in the southern half of the province. The latter two received a wildfire of note designation Friday afternoon.",
                "At the same time, officials are forecasting smoky skies across stretches of B.C. More than 320 fires are burning across the province, with more expected in the days ahead.",
                "Structures destroyed in Venables Valley",
                "Kevin Skrepnek, the emergency services co-ordinator for the Thompson-Nicola Regional District (TNRD), told CBC's Radio West Friday afternoon that the Shetland Creek fire had destroyed a number of structures in the Venables Valley, an agricultural region 70 kilometres west of Kamloops.",
                "'There was certainly some rumours going around this morning that the level of destruction was significant, like 40 to 50 structures. I don't have exact numbers, but it is a lot less than that. We're talking likely in the single digits,' he said.",
                "'Obviously, no less tragic for the folks who have lost their homes.'",
                "The Shetland Creek fire originated approximately 7.5 kilometres north of Spences Bridge on July 12. It has recently exploded in size, growing from 50 square kilometres on Thursday to more than 130 square kilometres on Friday.",
                "Thousand on alert from Shetland Creek wildfire",
                "The aggressive Shetland Creek fire has prompted several evacuation orders and alerts, including an alert for the entire Village of Ashcroft, with residents told to be ready to leave at a moment's notice.",
                "Approximately 2,000 residents are affected by the alert, which also extends to rural parts of the Thompson-Nicola Regional District (TNRD). Eight properties have already been ordered to evacuate.",
                "'We're getting ash falling on our cars, on our decks, on our houses, which is very disconcerting for people,' said Ashcroft Mayor Barbara Roden.",
                "On Thursday, the TNRD expanded its evacuation order to include about 85 properties in Venables Valley, which affects more than 120 people. The district also issued an evacuation alert for the area Thursday evening for around 170 properties from Spences Bridge to the border of the Ashcroft Ranch.",
                "The district has called for public support to help find accommodations for evacuees.",
                "According to Skrepnek, the fire is making a 'south to north push,' which means moving toward Ashcroft and Cache Creek.",
                "'The wind has really been ripping here, pretty much since noon, so unfortunately, yeah, those concerns are persisting ... definitely anticipating that we're going to continue to see this thing grow,' he said Friday afternoon.",
                "The Cook's Ferry Indian Band has issued orders for several reserves.",
                "New wildfires of note, village of Silverton under alert",
                "The BCWS says the two new wildfires of note — the Aylwin Creek fire and the Komonko Creek — are both located near the Valhalla Provincial Park in the Kootenay region and a few kilometres south from the village of Silverton.",
                "The Aylwin Creek fire was first discovered Thursday and is currently 1 square kilometre. The Komonko Creek fire was discovered Friday and has grown significantly to be around 4.5 square kilometres in size. Both are suspected to have been caused by lightning.",
                "In response to these blazes, authorities closed Highway 6 Friday to protect the safety of the public and emergency responders.",
                "On Friday evening, the Regional District of Central Kootenay (RDCK) issued an evacuation order for properties south of Silverton in the Red Mountain Road area and east of Slocan Lake due to the Aylwin Creek wildfire.",
                "Several areas that were on alert Thursday — such as the Bannock Point campground — are also now under an evacuation order, according to Dan Seguin, emergency operations centre director for RDCK.",
                "'The fire has crossed over from the west side of the highway to the east side of the highway, which is really what triggered the concern for the properties on Red Mountain Road and shifting those from an evacuation alert to order,' he said.",
                "In addition, the district has placed the entire Village of Silverton, a community of around 200 people, under an evacuation alert.",
                "Altogether, Seguin told CBC News around 200 properties in the RDCK are on alert and 129 properties on evacuation orders. Evacuees leaving the Silverton area are being directed to check in with the reception centre at the Kaslo Arena, due to the closure of Highway 6.",
                "Also nearby, the RDCK put in place an evacuation order Friday afternoon for 21 properties and a small portion of Valhalla Provincial Park on the west shore of Slocan Lake due to the Nemo Creek fire.",
                "Heat, smoky sky warnings",
                "On Friday, the province issued a smoky sky bulletin for parts of the Interior and north, warning that several communities were likely to be affected by wildfire smoke in the next 48 hours.",
                "The communities covered by the bulletin include Fort St. John, where air quality was measured at 10+ on Friday afternoon.",
                "Northern Health says it's 'proactively planning' for the potential of increased wildfire activities in the region and their effects, which could include moving patients or long-term care residents as a precaution measure or due to evacuation alerts and orders.",
                "Other regions experiencing or expecting smoky skies include Kamloops and the South Thompson, parts of the Kootenays including Creston, Cranbrook and Kimberly, Fort Nelson, the South Peace including Dawson Creek, the Arrow Lakes region and the 100 Mile House area.",
                "Environment Canada on Friday also issued a series of severe thunderstorm watches across much of the B.C. Interior, and a severe thunderstorm warning for the Stuart-Nechako region in the north.",
                "Heat warnings remain in place for much of the province's Interior and north, with temperatures above 30 C, reaching up to 40 C in some areas.",
                "Ken Dosanjh, a meteorologist with Environment and Climate Change Canada, says high temperatures are expected to continue until early next week.",
                "Dosanjh says thunderstorms and dry lightning that have occurred in the southern half of the province over the past few days are expected to continue throughout Friday.",
                "'Once you do get lightning strikes that occur, there's kind of a longer time scale where new fires will pop up,' he said.",
                "The BCWS says most of the fires burning in the province were started by lightning."
              ]
            }
        },
        {
            "title": "New wildfire in North Okanagan ‘being held’",
            "image": "Location of Sigalet Lake wildfire that was discovered July 7. (BC Wildfire Service image)",
            "imageDescription": "Sigalet Lake wildfire location map provided by BC Wildfire Service.",
            "author": "Pete McIntyre",
            "puplisher": "Vernon Matters",
            "link": "https://vernonmatters.ca/2024/07/09/new-wildfire-in-north-okanagan-being-held/",
            "date": "2024-07-09",
            "content": {
              "paragraphs": [
                "The BC Wildfire Service says a new wildfire discovered Sunday north-east of Lumby is now classified as being held.",
                "The fire near Sigalet Lake is estimated at 0.24 of a hectare in size.",
                "It’s believed to be human-caused.",
                "The BC Wildfire Service is reporting a new wildfire in the Kamloops Fire Centre.",
                "It is near Sigalet Lake, which is east of Mabel Lake.",
                "It was discovered on Sunday, July 7.",
                "Its current size is about a quarter of a hectare (0.24), and it's classified as out of control.",
                "It’s suspected to have been caused by lightning.",
                "Meantime, the Wildfire Service says the hot, dry conditions across the province are raising the risk of wildfire activity.",
                "The service says the heat wave is expected to persist until Wednesday, when a new weather pattern is forecast to bring high winds and the potential for thunderstorms with dry lightning strikes.",
                "As of 1:30 p.m. on July 8, there were 101 active fires in B.C. with 12 new fire starts in the last 24 hours.",
                "There are just four active fires in the Kamloops centre, with the other three near Lillooet either being held or under control."
              ]
            }
        },
        {
            "title": "A dozen wildfires burning in Okanagan, Shuswap",
            "image": "The fires burning in the Shuswap and Okanagan as of the morning of Friday, July 19 (Image courtesy of the B.C. Wildfire Service)",
            "imageDescription": "The fires burning in the Shuswap and Okanagan on July 19, 2024.",
            "author": "Liam Verster",
            "puplisher": "Vernon Matters",
            "link": "https://vernonmatters.ca/2024/07/19/a-dozen-wildfires-burning-in-okanagan-shuswap/",
            "date": "2024-07-19",
            "content": {
              "paragraphs": [
                "UPDATE 11:20 a.m. July 19",
                "The wildfire south of Kingfisher is now considered Under Control, and the Jack Creek Road fire has been re-classifies as Being Held.",
                "The other 12 fires are still Out of Control.",
                "— Original Story —",
                "The Okanagan and Shuswap have seen over a dozen fires ignite in the areas over the past 24 hours, with most of them still relatively small as of last update.",
                "As of 10:30 a.m. Friday, July 19, there were a total of 13 active fires within the two areas. Only one, a 90m² (0.009 hectare) spot fire located near Mabel Lake south of Kingfisher, was classified as ‘being held’, while the rest were considered out of control.",
                "The Columbia Shuswap Regional District (CSRD) said fire crews were actioning some of the fires that were burning in the area. The location of the fires, from north to south, and the responses as of the latest updates, were:",
                "Shuswap:",
                "Lower Blueberry Creek: 0.8 hectare fire east of Seymour Arm, being actioned by a B.C. Wildfire Service bucket helicopter, and two initial attack crews, four smoke jumpers (firefighters than parachute into the area), with assistance from the Shuswap Emergency Program’s Structure Protection Team.",
                "McNomee Creek: 0.3 hectare fire north of Seymour Arm with no resources assigned.",
                "Anstey Ridge: a 1.5 hectare wildfire approximately 32 kilometres north of Sicamous, with the CSRD saying a bucket helicopter and RapAttack crew (rappelling firefighter team) assigned to the fire.",
                "Four Mile Creek: 0.5 hectare fire located north of Sicamous with a bucketing helicopter assigned.",
                "Upper Griffin Mountain: 90m² fire near Highway 1 between Sicamous and Revelstoke, with the CSRD saying a bucket helicopter was assigned to the fire.",
                "Lower Griffin Mountain: 0.44 hectare fire near Highway 1 between Sicamous and Revelstoke, with the CSRD saying a bucket helicopter was assigned to the fire.",
                "Yard Creek: 90m² fire north of Kingfisher Creek Ecological Reserve with no resources assigned.",
                "Mara Mountain: 19.2 hectare fire southeast of Sicamous with no resources assigned.",
                "Cottonwood Creek: 0.42 hectare wildfire on the east side of Mable Lake with no resources assigned.",
                "North Okanagan:",
                "Jack Creek Road: 0.4 hectare wildfire south of Mabel Lake and west of Sugar Lake with no resources assigned.",
                "Sitkum Creek: 0.5 hectare wildfire east of Sugar Lake with no resources assigned.",
                "Outlet Creek Fire Service Road: 10 hectare wildfire east of Sugar Lake with no resources assigned.",
                "Central Okanagan:",
                "Unnamed wildfire east of Ellison Lake: a 90m² fire located along Postill Road with no resources assigned.",
                "The B.C. Wildfire Service noted all the above fires were suspected of being caused by lightning strikes.",
                "The BCWS and the CSRD advise people to prepare themselves for possible impacts of wildfires by having a ‘grab-and-go bag’ readily available. Details on what should be kept in those bags can be seen at the Prepared B.C. website.",
                "Anyone who sees smoke or fire is urged to report it to the BCWS by calling toll-free at 1-800-663-5555 or by dialing *5555 on a cell phone."
              ]
            }
        }
    
    ],
    "RegionalArticles": [
        {
        "title": "430 wildfires burn across B.C. with 107 starts in past 24 hours",
        "image": "https://vancouver.citynews.ca/wp-content/blogs.dir/sites/9/2024/07/a0acf549-c1ad-41d3-a45d-b007ff7abd7f-1024x699.jpg",
        "imageDescription": "A helicopter battling the Shetland Creek wildfire near Kamloops, B.C.",
        "author": "Greg Bowman and Charlie Carey",
        "puplisher": "City News",
        "date": "2024-07-24",
        "link":"https://vancouver.citynews.ca/2024/07/24/bc-wildfires-107-new-starts-wednesday/",
        "content": {
            "paragraphs": [
            "B.C. continues to see more wildfires spark across the province, as cooler weather brought wind and lightning to tinder-dry areas.",
            "The BC Wildfire Service says that as of Wednesday morning, there were 107 fire starts in the last 24 hours, bringing the total number of wildfires in the province to 430.",
            "The service adds a further 83 fires were put out in the past day.",
            "About 80 per cent of the fires were started by lightning, and about six per cent were caused by humans. The BCWS says recent thunderstorms brought 58,000 lightning strikes, and they expect to see new fire starts from those over the next few days.",
            "Over 258 fires are currently classified as \"out of control.\"",
            "During a wildfire update Wednesday afternoon, Minister of Emergency Management and Climate Readiness Bowinn Ma assured B.C. residents that the province is \"here to support you.\"",
            "\"Our service and emergency management personnel are working tirelessly and around the clock to keep you and your communities safe,\" she said.",
            "The wildfire service says local planes and helicopters, as well as aircraft from the Yukon, Ontario, Quebec, and Alaska, have joined the firefight, with almost 100 air tanker missions from July 18 to 21 dropping 5.4 million litres of suppressant.",
            "\"Right now, we are asking everyone to take steps to be prepared,\" Ma said. \"That means having your grab-and-go kit ready for your household. Have it packed and ready by your door.\"",
            "\"In your grab-and-go bag, it is important to include your emergency plan, copies of important documents, supplies for your pets, and cherished mementoes.\"",
            "People using bodies of water near out-of-control fires such as Shawnigan Lake adjacent to the Old Man Lake wildfire on Vancouver Island have been warned to \"keep well away\" from aircraft either skimming water or operating otherwise in the area.",
            "Meanwhile, the Shetland Creek fire is continuing to burn out of control west of Kamloops. It's nearing 200 square kilometres in size and has so far destroyed six homes.",
            "Near Quesnel, the Antler Creek wildfire has exploded in size over the last couple of days. The BCWS says the Antler Creek fire is considered \"out-of-control\" and sits at 14,283 hectares as of Tuesday night, almost five times bigger than Monday night. Evacuation orders are still in place for the Barkerville, Wells, and Bowron Lake park areas.",
            "An evacuation alert has been upgraded to an evacuation order in the North Okanagan due to wildfire activity. The Regional District of North Okanagan says the order is for the east side of Sugar Lake due to the Sitkum Creek Wildfire, based on recommendations from the BC Wildfire Service. The city says the change is because of \"immediate danger to life safety.\"",
            "\"All lands east of Sugar Lake, from the southern end to the northern tip, and from the east shore to a line north south-through Initiative Peak. This region includes all sites within Sugar Lake Resort at 1630 Sugar Lake Road,\" it said.",
            "According to BC Wildfire Services, the Sitkum Creek Wildfire, 63 kilometres northeast of Vernon is \"out-of-control\" at the size of 1,501 hectares, as of Tuesday afternoon.",
            "Around Slocan Lake, the Komonko Creek and Aylwin Creek wildfires are now over a combined six square kilometres. The fires have closed a part of Highway 6.",
            "Meanwhile, the City of Revelstoke issued an evacuation alert due Tuesday night due to a wildfire in the vicinity of Alpha Creek. The alert was issued for the north end of Armstrong Lake to Trout Lake, and Trout Lake up Lardeau Creek to Cup Creek. This includes Ferguson, Five Mile, and CM Galena.",
            "The city says the alert is issued because of the health, safety and welfare of the people in the areas.",
            "Minister Ma stressed that \"if you have friends or family that live in areas prone to wildfire, now is the time to reach out and offer your support.\"",
            "\"Being under an evacuation alert or an evacuation order can be incredibly stressful. It is important that we are there for each other during times of crisis, and that we prepare now for those times,\" she said. \"If you are placed under an evacuation order, you must leave immediately, follow all directions from local officials and evacuate using the routes that are identified in the evacuation order.\"",
            "After thousands of people were evacuated from Jasper, Alta., on Monday night, Ma shared that the province and Alberta government have been working \"closely\" to support evacuees and the response effort.",
            "\"The entire town of Jasper and Jasper National Park in Alberta was evacuated with very little notice. The only safe route for evacuees was to travel west along Highway 16 into British Columbia,\" she explained.",
            "Ma says the Alberta government has directed evacuees to emergency reception centres in Grand Prairie, Calgary, and Edmonton.",
            "\"I want to recognize the generosity of British Columbian communities along the evacuation route. They have stepped up for our neighbours and friends from Alberta in a major way. They assisted them through their journey during harrowing times, from Valemount, and McBride, and Prince George, to Clearwater, Barrier, and Kamloops — people, community leaders, and businesses have been pulling together to lend their support,\" Ma said.",
            "\"People opened their hearts and their homes to evacuees that needed support. … When people are in need, whether they are our friends, our loved ones, our neighbours or complete strangers, British Columbians come together and they step up in a big way. It is part of who we are, and I sincerely thank everyone who has assisted these efforts here in British Columbia.\""
            ]
        }
        },
        {
        "title": "B.C. wildfires: Fire numbers fall in B.C. as blaze near Golden destroys homes, spurs evacuation",
        "image": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2024/07/wildfires-bc-20240725.jpg?quality=90&strip=all&w=564&h=423&type=webp&sig=CBeCk7BJzXKCQyV6LtOD2Q",
        "imageDescription": "The Aylwin Creek wildfire burns near Slocan, B.C.",
        "author": "The Canadian Press",
        "puplisher": "Vancouver Sun",
        "date": "2024-07-25",
        "link":"https://vancouversun.com/news/cooler-temperatures-expected-respite-bc-wildfire-fight",
        "content": {
            "paragraphs": [
            "Three employees at Canadian Timberframes near Golden had no warning when a nearby wildfire jumped the Columbia River and “barrelled through” nearby homes, the company’s co-owner said.",
            "“The fire was out of control. The winds changed. It came so fast,” Stephanie Bowes said Thursday.",
            "“We weren’t even in part of the evacuation order,” she noted, although the order did come shortly after as the employees were helping to fight the fire.",
            "The Town of Golden confirmed about six homes were lost in the fire burning south of the community, but said “assessments are still underway to determine the extent of the damage.”",
            "It said in an earlier social media post that the blaze, known as the Dogtooth Forest Service Road fire, had spread north, but rain and a northern wind were expected to help the fire fight.",
            "The B.C. Wildfire Service said that a trend of cooler weather across much of the province had also resulted in a dip in the number of fires burning and allowed crews an opportunity to make progress on some of the approximately 420 active blazes.",
            "It’s the first time fire numbers have dropped in weeks.",
            "However, the service said the fires of note — those that pose a threat to people or property or are highly visible — had increased to five, with the addition of the Dogtooth fire.",
            "The B.C. Wildfire Service said Thursday afternoon that the blaze had grown enormously, although the town said most of that growth happened on Wednesday.",
            "“No injuries or loss of life have been reported for residents or incident responders,” the town said.",
            "Bowes said she and her husband, with whom she owns the timber-framed homes business, were at their cottage in Anglemont, about 300 kilometres away, when their workers said the blaze had “engulfed” trees around the work site on Wednesday.",
            "Her husband immediately rushed back.",
            "She said the business remained intact thanks to its cement retaining walls and the “tireless” work of wildfire crews.",
            "“The fire is still out of control, but it seems to be in control around our property. There’s just smouldering fires that they’re continuously putting out throughout the property,” she said, noting light rains and wind had brought some reprieve Thursday.",
            "“I’m just so very thankful and grateful that we have been able to come out of this where a lot of houses and homes and properties have not and my heart goes out to everybody.”",
            "The Town of Golden’s website said authorities were focused on “saving as many structures as possible” from the Dogtooth fire, which prompted evacuation orders on Wednesday for properties along the Columbia River as it runs beside Highway 95.",
            "In an update Thursday afternoon, the town said the evacuation order for the properties on the east side of the highway was rescinded and replaced with an alert. More than 1,000 properties remained on alert, while 28 properties on the west side of the river remained on evacuation order.",
            "The update also said Highway 95 had reopened, but access to the areas under evacuation order would be restricted.",
            "Despite the improved weather, about 230 fires continue to burn out of control in the province, including a cluster in southeastern B.C., a region that has seen thousands of lightning strikes in a series of thunderstorms. The service said that region continues to be warm and dry.",
            "In central and northern B.C., the wildfire service said rain and a break from warmer-than-usual weather are providing a much-needed respite.",
            "The service said that in the past week at least 263 fires had been declared out, and at least 124 brought under control.",
            "The cooler weather brought highs in the low to mid-20s in areas including Kamloops, Kelowna and Lytton, where temperatures surpassed 40 C just days ago.",
            "Temperatures in the northern Interior, including Prince George and Williams Lake, did not get above the mid-teens.",
            "B.C. firefighters had been battling a spike in wildfires since the weekend, when dry weather and a heat wave were followed by tens of thousands of lightning strikes. There were fewer than 100 fires burning on July 8.",
            "Among the most severe wildfires in the province is the 225-square-kilometre Shetland Creek blaze near Spences Bridge, which has destroyed about 20 structures in the Venables Valley, including at least six homes.",
            "But the Village of Ashcroft said in a notice that it had rescinded its evacuation alert for all properties in the area.",
            "Another fire of note is the four-square-kilometre Aylwin Creek blaze south of Silverton in the Central Kootenay region, which has triggered an evacuation order for the entire village along with 17 nearby properties.",
            "A few kilometres to the north, a further 16 properties have been ordered evacuated outside the community of New Denver due to the Wilson Creek wildfire.",
            "The Regional District of Central Kootenay has also upgraded an evacuation alert to an order for the Argenta and Johnsons Landing areas due to the Argenta Creek blaze. The order spans 191 properties on the northeast shore of Kootenay Lake.",
            "On Vancouver Island, the Old Man Lake wildfire burns out of control about nine kilometres north of Sooke.",
            "That fire, at about 1.7 square kilometres in size, has seen some growth, but the spread has been “away from any structures or critical infrastructure,” Julia Caranci with the Coastal Fire Centre said on an updated post on YouTube.",
            "The Capital Regional District says the fire is burning a few kilometres south of the Sooke Lake Reservoir, which is part of the water supply for about 350,000 people in Greater Victoria."
            ]
        }
        },
        {
        "title": "Heat builds again in B.C. after cool reprieve for wildfire crews",
        "image": "https://i.cbc.ca/1.7259318.1720623861!/cumulusImage/httpImage/image.jpg_gen/derivatives/16x9_780/hot-weather.jpg",
        "imageDescription": "Temperatures are expected to reach past 35 C in southeastern B.C. heading into the weekend.",
        "author": "CBC News",
        "puplisher": "CBC",
        "date": "2024-08-01",
        "link":"https://www.cbc.ca/news/canada/british-columbia/bc-wildfires-aug-1-2024-1.7282111",
        "content": {
            "paragraphs": [
            "The heat is building again after days of rainfall and cooler temperatures tempered fire behaviour across B.C. The province is also seeing two new wildfires that are considered to be highly visible or pose a potential threat to public safety.",
            "On Thursday, Environment and Climate Change Canada issued heat warnings for many parts of southern B.C., including much of the Okanagan, the Kootenays, the North and South Thompson, and eastern Vancouver Island.",
            "Daytime highs through the weekend are expected to reach the high 30s in Interior areas and the high 20s on eastern Vancouver Island, the weather agency's warning said.",
            "Environment Canada meteorologist Ken Dosanjh told CBC News a ridge of high pressure is building in southern B.C.",
            "He said temperatures will peak around Friday and Saturday, and then cool off slightly into next week. While he said B.C. won't see the same prolonged heat wave as last month, temperatures will be a little higher at night.",
            "\"We are continuing this trend of real summer-like conditions.\" he said. \"Earlier in the week we saw that little blip of some wet weather and some clouds — well, that's now behind us and we're continuing with the dry and anomalous temperatures for the summer.\"",
            "As of Thursday, there are around 1,100 people under evacuation order and approximately 2,400 people under alert in B.C., according to the province's Ministry of Emergency Management and Climate Readiness (EMCR).",
            "The B.C. Wildfire Service (BCWS) has now increased the number of wildfires of note — fires that are highly visible or pose a threat to public safety — from six to eight.",
            "The two new wildfires include the 23-square-kilometre Dunn Creek fire, which is located near the unincorporated community of Little Fort and on the east side of Dunn Lake. The second one is the 13-square-kilometre Sitkum Creek fire, which is burning near the access to Monashee Provincial Park.",
            "Both wildfires are under the Kamloops Fire Centre's area in the province's southern interior and are suspected to have been caused by lightning.",
            "Also located in the same centre is the 244-square-kilometre Shetland Creek wildfire.",
            "This wildfire is \"displaying increased fire behaviour on its southwest corner, north of Pasulko Peak,\" the BCWS said Thursday evening. The service added that increased smoke may be visible from Lytton, Spences Bridge, Logan Lake as well as the stretch of Highway 1 near these areas.",
            "Elsewhere in the province, two wildfires of note are burning on the eastern shore of Slocan Lake in the West Kootenay. A large swath of land, including the entire community of Slocan, remains under evacuation order.",
            "As of Thursday night, around 330 wildfires are still active in the province, according to BCWS, with about 40 per cent of them considered out of control.",
            "Fire activities have been lower over the past few days thanks to a recent cool spell, but the heat is renewing concerns for firefighting crews.",
            "Jaedon Cooke with the BCWS said the weather will dry out fuels on the ground, making it susceptible to new fires and increased fire activity.",
            "\"The summer's not over yet,\" she said. \"A return to challenging conditions is a real possibility.\"",
            "Cooke said higher temperatures overnight means there's less chance fire activity will slow down.",
            "\"It doesn't give us as much recovery overnight,\" she said.",
            "In a news release Thursday, EMCR and the B.C. Ministry of Forests said many parts of the province are again seeing increased wildfire risk.",
            "Combined with the record-breaking temperatures in July 2024 and ongoing drought, people in B.C. are encouraged to be prepared for the continued higher risk of wildfire in the province, the ministries said.",
            "Dosanjh said this spell of heat will come with an elevated risk of thunderstorms. On Thursday, most thunderstorm activity will take place near Fort Nelson in northern B.C., he said.",
            "He forecasts lightning activity will move south over the weekend, with little to light rainfall. More rain might accompany thunderstorms next week, Dosanjh said.",
            "The Columbia Shuswap Regional District also warns of the possibility of dry lightning in the coming days. The district said Thursday that residents are strongly advised to prepare for a possible evacuation should their area be affected by wildfire.",
            "More than 90 per cent of the currently active wildfires were started by lightning, according to the BCWS.",
            "As of noon on Thursday, the campfire ban for the northern half of the province is being rescinded, though campers are being urged to exercise caution when setting and maintaining fires.",
            "Natural Resources Canada says it expects warmer-than-average temperatures and drought conditions to happen more often as the climate changes, increasing the frequency and size of wildfires."
            ]
        }
        },
        {
        "title": "Vancouver Island wildfire grows overnight, remains out of control",
        "image": "https://bc.ctvnews.ca/content/dam/ctvnews/en/images/2024/7/24/sooke-wildfire-1-6976217-1721849706250.jpg",
        "imageDescription": "The Old Man Lake fire in the Sooke Potholes Regional Park grew to 80 hectares Wednesday, July 24, 2024.",
        "author": "Todd Coyne",
        "puplisher": "CTV News",
        "date": "2024-07-25",
        "link": "https://bc.ctvnews.ca/vancouver-island-wildfire-grows-overnight-remains-out-of-control-1.6976216",
        "content": {
            "paragraphs": [
            "A wildfire burning out of control on Vancouver Island continued to spread Wednesday as the provincial wildfire service assigned more resources to try to contain the blaze.",
            "The Old Man Lake fire in the Sooke Potholes Regional Park, west of Victoria, grew to 169 hectares Wednesday night, blanketing southern Vancouver Island and parts of B.C.'s Lower Mainland with smoke.",
            "The fire was discovered Monday afternoon, when it measured just three hectares, and is believed to be human-caused. By Tuesday, the fire had grown to 50 hectares, forcing the closure and evacuation of the park area.",
            "The B.C. Wildfire Service said five ground-attack crews and three helicopters were dousing the flames Wednesday. A 10-person crew from the Capital Regional District was also working to contain the blaze.",
            "This fire is burning in steep and challenging terrain,\" Julia Caranci, a spokesperson for the wildfire service's Costal Fire Centre, said in an update, referring to the fire as \"an emerging incident.\"",
            "Firefighting aircraft have been using nearby Shawnigan Lake to refill their water holds, prompting the wildfire service to warn boaters to keep their distance from the aircraft.",
            "\"All boaters are required to dock immediately if aircraft are operating on the lake as any obstruction to approach, filling and departures will cause the mission to be aborted,\" the wildfire service said in a statement.",
            "The Sooke fire was one of 260 wildfires classified as out of control in B.C. Wednesday afternoon as more than 400 wildfires burned across the province.",
            "A smoky skies bulletin has been issued for southern Vancouver Island due to the nearby blaze. Environment Canada warns that wildfire smoke contains fine particles, which can pose health risks for vulnerable people."
            ]
        }
        },
        {
        "title": "B.C. wildfires: Local state of emergency declared in Williams Lake",
        "image": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2024/07/wildfires-bc-20240721.jpg?quality=90&strip=all&w=564&h=423&type=webp&sig=aQVlymxqvD8_P7Xu3llgHA",
        "imageDescription": "An aerial view of a wildfire burning on Steamboat Mountain.",
        "author": "The Canadian Press",
        "puplisher": "Vancouver Sun",
        "date": "2024-07-21",
        "link": "https://vancouversun.com/news/evacuation-orders-bc-heat-wave",
        "content": {
            "paragraphs": [
            "Lightning-triggered wildfires over the weekend have prompted a number of evacuation orders and alerts across B.C., a situation that has been exacerbated by the ongoing heat wave.",
            "The B.C. Wildfire Service said Sunday that crews are battling more than 300 blazes, with several evacuation orders in effect in both Central and East Kootenay as well as in Thompson-Nicola, Cariboo, and Bulkley–Nechako in the northwest.",
            "“Fire suppression efforts continue to be challenged due to hot, dry conditions and localized winds,” the wildfire service said in its Sunday update. “A three-week heat wave continues, and more hot and dry conditions are expected to continue for most of the province.”",
            "A local state of emergency was declared on Sunday night in Williams Lake, where the River Valley wildfire is burning within city limits.",
            "An evacuation alert has been issued for properties from the intersection of Highway 20 and Mackenzie Avenue to the Jackpine Sawmill Access Road on Mackenzie Avenue near Atlantic Power’s Williams Lake plant.",
            "The declaration Sunday came shortly after British Columbia’s minister for emergency management, Bowinn Ma, said evacuation alerts were being issued to follow up tactical evacuations.",
            "Earlier in the day, the city of Williams Lake asked residents on X to conserve as much water as possible for fire crews taking on the blaze.",
            "The city says it is aware that the fire reportedly started in the river valley northwest of the city Sunday afternoon.",
            "As of 9 p.m., the B.C. Wildfire Service reports the wildfire was around two-tenths of a hectare and is classified as out of control.",
            "Environment Canada said 14 B.C. communities broke or matched their daily high-temperature records on Saturday, with Lytton reaching a high of 41.2 degrees — breaking a record of 40.6 degrees set in 1946.",
            "Temperature records also fell in the B.C. communities of Cranbrook, Merritt, Princeton, Trail, and Vernon, with all five communities reaching at least 36 degrees.",
            "Firefighters say the high temperatures have made conditions difficult once a fire ignites, with crews having to prioritize initial attacks on newly discovered blazes.",
            "One such fire is the Island Pond fire about 17 kilometres south of Canal Flats in the East Kootenay, which was discovered Saturday and grew to about one square kilometre on Sunday.",
            "The Regional District of East Kootenay has declared a state of local emergency and issued an evacuation order for two addresses as a result, and has also warned another 65 properties to be prepared to leave on short notice.",
            "At the Cariboo Regional District in central Interior B.C., officials have ordered residents on 29 parcels of land in the Kuyakuz Lake area covering 923 square kilometres to evacuate immediately, with five out-of-control wildfires burning nearby.",
            "Four of the five blazes have been confirmed to be lightning-caused.",
            "The regional district has also issued alerts for the Barkerville Historic Town and Park heritage site with a cluster of out-of-control fires — including the 13.5-square-kilometre Antler Creek blaze — burning in the area.",
            "Barkerville public programming and media manager Stewart Cawood said the alert led to the park closing on Sunday, and staff will determine day-by-day if the conditions allow the heritage site to open.",
            "“It’s incredibly frustrating,” Cawood said, noting the park has been working hard to regain visitor traffic since the end of the COVID pandemic. “Unfortunately, we are at the whims and wills of Mother Nature, so there’s not much we can do.",
            "“When something like this happens, we just have to be able to roll with the punches and keep everybody safe.”",
            "Cawood said he was also concerned about the longer-term implications of wildfires’ effect on B.C.’s tourism sector on places like Barkerville.",
            "“Up until last week, we were seeing a rise of about 12 per cent in our numbers from last year, so we’ve been seeing a nice, steady incline since we’ve had to scale things back during the COVID years,” he said.",
            "The new evacuation orders and alerts come as the Shetland Creek fire about eight kilometres north of Spences Bridge, B.C., is holding at about 150 square kilometres in size.",
            "The B.C. Wildfire Service dashboard says about 87 per cent of the more than 300 blazes burning in the province have been caused by lightning.",
            "All evacuation orders and alerts linked to the Shetland Creek blaze in B.C.’s Thompson-Nicola region remain in place on Sunday for communities such as Ashcroft, Cache Creek, Spences Bridge, and the Ashcroft First Nation.",
            "In the Central Kootenay, the community of Silverton also remained on alert Sunday while 107 properties south of the village were under an evacuation order due to the nearby Aylwin Creek wildfire.",
            "Aylwin Creek and nearby Komonko Creek remained at a combined size of 6.5 square kilometres Sunday, and Highway 6 south of Silverton has been closed due to the two out-of-control wildfires.",
            "Evacuation orders have also been issued across Slocan Lake from Silverton, with residents and visitors at 21 waterfront parcels as well as a small part of Valhalla Provincial Park near Nemo Creek being told to leave immediately."
            ]
        }
        },
        {
        "title": "More than 320 wildfires burn in B.C. as Barkerville, Wells ordered to evacuate",
        "image": "https://vancouver.citynews.ca/wp-content/blogs.dir/sites/9/2024/07/22/SPS-Barkerville-1-1024x768.jpeg",
        "imageDescription": "Sprinklers on top of buildings in Barkerville, B.C. as part of wildfire mitigation efforts.",
        "author": "Charlie Carey",
        "puplisher": "City News",
        "date": "2024-07-22",
        "link": "https://vancouver.citynews.ca/2024/07/22/bc-wildfires-record-july-temperatures/",
        "content": {
            "paragraphs": [
            "More than 20 wildfires were sparked on Sunday alone, the BC Wildfire Service dashboard says, as two dozen one-day heat records fell and multiple towns in the Cariboo were ordered to evacuate.",
            "Around 5:30 p.m. Sunday, the Cariboo Regional District and the District of Wells ordered Wells, Barkerville, Bowron Lakes, and the west side of Bowron Lakes chain to evacuate due to a nearby wildfire.",
            "“Wildfires in the area pose a threat to human life,” the Emergency Info BC said in a statement.",
            "All residents are being urged to leave the area and head west along Highway 26 to Quesnel.",
            "“If you are being evacuated from your primary residence, an evacuee reception center is open at the Quesnel and District Arts and Recreation Centre located at 500 North Star Road. Visitors to the area are advised to leave the area,” the province said.",
            "According to the wildfire service, the Antler Creek Wildfire is approximately 3,162 hectares. The blaze was first discovered on July 20 after a lightning storm hit the region.",
            "The BCWS says ground crews, air crews, heavy equipment, and structure protection are all on-site helping to mitigate any possible damage from the wildfire.",
            "The evacuation order comes after Environment and Climate Change Canada reported Lytton to be the hot spot in all of Canada again on July 21, recording a top temperature of 42.2 degrees.",
            "It just overtook the old July 21 record of 42.1 which was set in 2006. Records have been kept in the Lytton area since 1921.",
            "The BC Wildfire Service says that as of Monday morning, 326 wildfires are burning across the province.",
            "Ashcroft also saw a new record, seeing a top temperature of 37.8, passing the old record of 37 set in 1994.",
            "Highway 1 between Ashcroft and Spences Bridge is closed due to the Shetland Creek Wildfire. As of Sunday night, the Shetland Creek fire was an estimated 14,830.9 hectares.",
            "“This wildfire is highly visible or poses a potential threat to public safety,” the BC Wildfire Service explains on its website. The out-of-control fire is believed to have been caused by lightning.",
            "Prolonged, tinder-dry conditions have exacerbated the wildfire risk, the BC Wildfire Service says. On Saturday, the BCWS shared that there had been 1,277 lightning strikes in just four days.",
            "On Sunday, a wildfire was sparked in the Cariboo city of Williams Lake. Evacuation alerts were in place overnight, with the city declaring a state of local emergency Sunday evening. By Monday morning, the BC Wildfire Service says 326 fires are burning across the province.",
            "North of Williams Lake, Prince George, and Quesnel also broke their one-day temperature records on Sunday, recording top temperatures of 38.3 and 38.1 respectively.",
            "Meanwhile, Blue River, Clearwater, Cranbrook, Dawson Creek, Dease Lake, Golden Area, Kamloops, Lillooet, MacKenzie, Merritt, Nelson, Penticton, Princeton, Smithers, Sparwood, Summerland, Trail, Vernon, and Yoho National Park all saw record-setting heat on Sunday."
            ]
        }
        },
        {
        "title": "Wildfires erupt in B.C. with lightning, heat fuelling fire behaviour across province",
        "image": "https://smartcdn.gprod.postmedia.digital/vancouversun/wp-content/uploads/2024/07/wildfire-bc-20240720.jpg?quality=90&strip=all&w=564&h=423&type=webp&sig=T_0iW_3lZf9HlJLG4pR80A",
        "imageDescription": "An out-of-control wildfire burns near Wahleach Lake in southern British Columbia.",
        "author": "The Canadian Press",
        "puplisher": "Vancouver Sun",
        "date": "2024-07-20",
        "link": "https://vancouversun.com/news/wildfires-erupt-in-b-c-with-more-heat-and-thunderstorms-on-the-way",
        "content": {
            "paragraphs": [
            "The mayor of a British Columbia Interior community says the area’s long-term care residents have been moved out as a fast-moving wildfire looms nearby.",
            "Barbara Roden, mayor of Ashcroft, located about 360 kilometres northeast of Vancouver, said Saturday that the community remains under an alert to be ready to evacuate on short notice.",
            "Roden said the anxiety among residents is “settling down a little bit” as the nearby Shetland Creek wildfire appeared to push northward Saturday.",
            "“In the early stages of a fire, there is of course a lot of stress, a lot of fear, a lot of nervousness,” she said. “(But) we’ve seen that the fire has largely stayed in a northerly course, not veering off to the east towards Ashcroft or Cache Creek, the more populated areas in this region.”",
            "Roden said crews have also helped the community’s psyche by keeping nearby Highway 1 open despite the Shetland Creek blaze growing to about 150 square kilometres in size.",
            "“The highway has remained open throughout, which is … I think, a big stress relief for people,” she said. “Not just because it’s an evacuation route possibly, but just because having a highway open, it’s almost a feeling of normalcy with traffic still moving up and down the highway.”",
            "Nevertheless, Roden said Interior Health has decided to relocate 21 long-term care residents and five in assisted-living facilities from Ashcroft in case the fire changes direction.",
            "“I think right now, we’re in a stage where it’s wait-and-see what the fire is going to do,” she said.",
            "Roden’s comments came as the Thompson-Nicola Regional District confirmed Venables Valley — just a few kilometres southwest of Ashcroft — has seen a number of structures destroyed by the Shetland Creek fire as of Saturday.",
            "The regional district’s emergency centre said officials have not been able to access the area to assess specific numbers, but preliminary estimates put the number of structures destroyed at less than 10.",
            "Meanwhile, the number of wildfires in British Columbia has flared up to more than 300, with more than half of those classified as out of control and about 70 started in the last 24 hours.",
            "The B.C. Wildfire Service said one of the primary drivers in the latest spike has been lightning; officials estimate there have been close to 1,300 strikes in the province since Wednesday and 94 new ignitions.",
            "Firefighters in the province’s northwest said that region received “significant lightning” on Friday resulting in 13 new fires, although three have been extinguished.",
            "The wildfire service said the situation has been exacerbated by dryness, as recent heat waves across the province have created conditions conducive to higher fire activity.",
            "“The prolonged hot and dry conditions being experienced across the Southeast Fire Centre, paired with passing storm systems, means that residents can expect to continue to see increased overall wildfire activity across the region,” the B.C. Wildfire Service said in its Saturday update on social media.",
            "“With no rainfall in the southern regions the fire danger is high to extreme in most areas,” the service said in a separate update Saturday.",
            "In addition to Ashcroft, the Shetland Creek fire has so far triggered evacuation orders and alerts in Cache Creek, Spences Bridge, the Ashcroft First Nation and several Cook’s Ferry Indian Band reserves.",
            "Further east, another two fires ignited by lightning in the Kootenay region have prompted evacuation orders for 107 properties south of Silverton, B.C.",
            "The Regional District of Central Kootenay said the Aylwin Creek and Komonko Creek blazes near the shores of Slocan Lake have reached a combined 6.5 square kilometres in size.",
            "The regional district has also issued an alert for Silverton itself, with residents told to be ready to evacuate on short notice and Highway 6 in the area closing due to the adjacent blazes.",
            "In northwestern B.C., the Regional District of Bulkley-Nechako has issued an evacuation order for the Laidman and Williamson lakes areas about 110 kilometres southwest of Vanderhoof.",
            "The wildfire service said skimmers and helicopters will be using local water sources in many places such as the Arrow and Kootenay lakes area as well as in the Columbia fire zone, and boaters are asked to stay away from aircraft involved in the firefighting effort.",
            "People are also being asked to stay away from firefighters’ work sites for similar safety reasons.",
            "“People using other watercraft in the intended flight path present a serious safety risk for aircrews and anyone else in the area,” the B.C. Wildfire Service statement says. “This behaviour is extremely dangerous and interferes with our ability to fight wildfires.”",
            "Heat warnings continue to cover a large section of south and eastern B.C., with Environment Canada reporting the Kelowna, Cranbrook, Vernon and Nakusp areas all broke high-temperature records on Friday. Highs in Kelowna reached 38.6 degrees.",
            "The federal weather agency warned the above-average temperatures will likely last into early next week.",
            "Along with the high temperatures and nearby wildfires, forecasters said smoke conditions are also expected to increase, while fires burning in Alberta are expected to bring smoke into the northeastern corner of B.C.",
            "Environment Canada has issued special statements about the wildfire smoke affecting air quality in places such as the Slocan Lake, Peace River, East Kootenay, Fort Nelson and South Thompson areas, asking residents to limit outdoor activities.",
            "B.C. Wildfire Service said there are almost 1,000 provincial firefighters on the ground along with resources from Nova Scotia and Ontario as well as Australia and New Zealand."
            ]
        }
        }
    ],
    "NationalArticles": [
        {
            "title": "Eastern Canada wildfire evacuates thousands",
            "image": "https://i0.wp.com/wildfiretoday.com/wp-content/uploads/2024/07/Screen-Shot-2024-07-14-at-5.53.34-PM.png?resize=900%2C646&ssl=1",
            "imageDescription": "Map showing the location of wildfires in Newfoundland and Labrador.",
            "author": "Kelly Andersson",
            "publisher": "Wildfire Today",
            "link": "https://wildfiretoday.com/2024/07/14/eastern-canada-wildfire-evacuates-thousands/",
            "date": "2024-07-14",
            "content": {
              "paragraphs": [
                "A fire east of Québec in Newfoundland and Labrador has burned more than 24,000 acres and forced thousands to evacuate Labrador City. CNN reported that the 'extremely aggressive inferno' was considered contained earlier this week, but weather changes on Friday blew the fire back to life and it spread rapidly. Premier of Newfoundland and Labrador Andrew Furey said Saturday the fire had grown to 22,000 acres and had spread 13 miles in about four hours.",
                "In a news conference on Sunday, Furey said weather conditions are favourable for firefighting. 'We have some good news today. There is no significant growth in the size of the fire that is just northwest of Lab City,' he told reporters. The fire has burned through about 14,000 hectares (about 35,000 acres) to within four kilometres of the community — the same as Saturday.",
                "Light rain, lower temperature and humidity, and northeast winds has kept the fire away from the town and burning onto itself.",
                "Four water bombers are fighting on the eastern front of the fire. Six to eight are fighting on the western side from Quebec.",
                "Around 9,500 people were evacuated from Labrador City, said Jeremy Reynolds with the provincial government. 'A contingent of essential personnel have remained behind to oversee the emergency response,' he said.",
                "The remote town of Labrador City, in the northwestern part of the province, is about 900 miles north of Canada’s capital city of Ottawa.",
                "A province-wide outdoor fire ban prohibiting setting of fires on forest land or within 300 metres of forest land is now in effect in Newfoundland and Labrador.",
                "Significant firefighting resources are currently dedicated to wildfire suppression near the communities of Labrador West.",
                "Updates on the location, status, and size of active fires can be viewed online at the NL Active Wildfire Dashboard.",
                "Residents were told to evacuate to the Town of Happy Valley-Goose Bay – a six-hour drive away."
              ]
            }
        },
        {
            "title": "Smoke from Canadian wildfires reaches Europe",
            "image": "https://atmosphere.copernicus.eu/sites/default/files/inline-images/cams_gfasv1p2_frpfire_canada_august_2024.png",
            "imageDescription": "Fire locations and fire radiative power over North America for August 2024. Source: CAMS GFASv1.2",
            "publisher": "Copernicus Atmosphere Monitoring Service",
            "link": "https://atmosphere.copernicus.eu/smoke-canadian-wildfires-reaches-europe",
            "date": "2024-08-20",
            "content": {
              "paragraphs": [
                "As wildfires continue to burn across Western Canada, smoke continues to affect air quality in North America and further afield. In recent days, smoke from Canada’s wildfires has been transported across the North Atlantic to reach Europe, resulting in hazy skies and sunsets. The Copernicus Atmosphere Monitoring Service (CAMS) has been closely tracking the fires and their impacts. Let’s take a closer look.",
                "Large-scale wildfires are continuing to burn across boreal regions of North America this month. A map of fire locations over North America in August shows some of the main fire activity to be in the Northwest Territories of Canada, with British Columbia, Alberta, Saskatchewan and Manitoba also standing out as experiencing significant wildfire activity.",
                "As a result, Northwest Territories, Saskatchewan and Manitoba have already seen their highest wildfire carbon emissions for August in the GFAS dataset, contributing to the August total estimated emissions for Canada of just over 80 megatonnes, approaching the level of 2023 in which the country experienced its highest August carbon emissions since 2003. As a result, 2024 is already one of the most extreme years of the last two decades for Canada and is set to be second only to 2023 in terms of emissions.",
                "The intensity and emissions of wildfires across Canada has been increasing throughout the summer, with British Columbia and Alberta dominating the totals in July. The number of fires and emissions have increased sharply in Northwest Territories through August, following heatwave conditions across the region at the beginning of the month. The total estimated wildfire carbon emissions in Northwest Territories from 1 January to 19 August exceed 70 megatonnes and are only behind 2023 and 2014 in terms of the annual total fire emissions for the territory. For Canada, British Columbia and Alberta, 2024 is second only to 2023 in terms of annual total fire emissions. In Saskatchewan carbon emissions are estimated at over 11 megatonnes for August, while emissions in Manitoba are currently at over 5 megatonnes. In both provinces, these emissions are the highest in the CAMS record for August. Wildfire carbon emissions in Ontario are currently estimated at 0.6 megatonnes, the third highest in the CAMS record, behind 2021 and 2017.",
                "The wildfires have been affecting air quality, both locally and further afield. Long-range transport of the smoke has reached eastern Canada and the east coast of the United States, bringing hazy skies and contributing to reduced air quality in major cities across the region. Since 10 August, smoke from the Canadian wildfires has been crossing the North Atlantic, reaching western Europe on 17 August, resulting in high aerosol optical depth values (AOD > 1) in the CAMS forecast. AOD is the measure of particulate matter and aerosols such as desert dust or, in the case of the Canadian wildfires, smoke particles distributed within a column of air from the Earth's surface to the top of the atmosphere.",
                "The CAMS analyses (which are the combination of the model with the latest satellite observations) show significant smoke transport across Canada and the North Atlantic between 10 and 19 August, with high AOD values reaching Ireland and the United Kingdom and moving on across the continent from France to Scandinavia.",
                "Evaluation of the CAMS forecasts against independent Aeronet measurements shows good agreement in the timing and magnitude of the AOD evaluations at several sites, including Cork in Ireland, Camborne in the United Kingdom, and Brest and Arcachon in France."
              ]
            }
        },
        {
            "title": "Canadian wildfires prompt more evacuation orders, air-quality warnings",
            "image": "https://www.aljazeera.com/wp-content/uploads/2024/07/2024-07-23T140814Z_381413302_RC2G09AF8K84_RTRMADP_3_CANADA-WILDFIRES-1721854231.jpg?resize=770%2C513&quality=80]",
            "imageDescription": "Smoke and flames from a wildfire near Williams Lake, British Columbia.",
            "author": "Al Jazeera",
            "publisher": "Al Jazeera",
            "link": "https://www.aljazeera.com/news/2024/7/24/canadian-wildfires-prompt-more-evacuation-orders-air-quality-warnings",
            "date": "2024-07-24",
            "content": {
              "paragraphs": [
                "Hundreds of out-of-control wildfires are burning across western Canada, putting more communities under evacuation alert and raising concerns about air quality.",
                "Authorities at the BC Wildlife Service said on Wednesday that 430 active wildfires were burning in British Columbia (BC) along with 177 more in neighbouring Alberta, including near Jasper National Park in the Canadian Rockies, one of the country’s most popular tourist destinations.",
                "Canada’s westernmost province, BC was hit by more than 58,000 lightning strikes, according to the provincial wildfire agency, sparking scores of new blazes in forests that are tinder-dry after a three-week heat wave.",
                "Park rangers scoured Jasper National Park in helicopters on Wednesday to look for people still inside despite a mass evacuation aiming to move 25,000 visitors and residents away from two large wildfires.",
                "Searchers looking through the backcountry trails of the park already had picked up 245 people, Parks Canada Incident Commander Katie Ellsworth told reporters.",
                "As many as 15,000 people were believed to be in the park and 10,000 in the neighbouring town of Jasper late Monday when authorities issued an alert asking everyone in the area to evacuate.",
                "“The town of Jasper and Jasper National Park have been evacuated due to two active wildfires,” Jasper National Park said in a social media post.",
                "“The evacuation of the townsite and frontcountry is complete. Evacuations in the backcountry are ongoing and complete in high priority areas,” it said.",
                "“Our highest priorities are to protect the town of Jasper and limit wildfire growth towards the town, Highway 16, and critical infrastructure.”",
                "Ellsworth said the north fire, spanning about 272 hectares (672 acres), is about 5km (three miles) from Jasper while the south fire, about 10,800 hectares (26,600 acres), is some 8km (about five miles) away.",
                "Rain was expected into Thursday but not enough to control the blazes, with no word yet on when people could return, she added.",
                "Photos and videos shared on social media overnight from Monday to Tuesday showed a line of bumper-to-bumper cars and trucks crawling through smoke to try to get out of the area.",
                "Jasper resident Addison McNeill, 24, said she had just moved to the town from Edmonton when she got the stressful alert on Monday night to evacuate.",
                "“Every single person in town was beelining to one exit from about six different routes, and so you get bottleneck, backups and congestion,” she told The Associated Press.",
                "Many communities in western Canada also have been blanketed by thick smoke, including Alberta’s largest city, Calgary, where residents were advised to limit time outdoors.",
                "The Canadian government warned Calgary residents on Wednesday morning that wildfire smoke was causing “very poor air quality and reduced visibility”.",
                "“During heavy smoke conditions, everyone is at risk regardless of their age or health. The fine particles in wildfire smoke pose the main health risk,” it said in a weather advisory.",
                "In April, federal officials said Canada risked another “catastrophic” wildfire season amid higher-than-normal spring and summer temperatures across much of the country.",
                "Last year, the country experienced a record fire season that saw more than 6,600 wildfires burn 15 million hectares (37 million acres).",
                "Experts have said that climate change has extended the Canadian wildfire season and made it easier for blazes to start and spread."
              ]
            }
        },
        {
            "title": "Two charged with arson in Cat Lake First Nation fire",
            "author": "Leith Dunick",
            "publisher": "NWO news watch",
            "link": "https://www.nwonewswatch.com/local-news/two-charged-with-arson-in-cat-lake-first-nation-fire-9612715",
            "date": "2024-10-04",
            "image": "https://www.vmcdn.ca/f/files/tbnewswatch/images/local-news/2019/january/cat-lake-first-nation/cat-lake-first-nation.jpg;w=960",
            "imageDescription": "A sign at Cat Lake First Nation.",
            "content": {
              "paragraphs": [
                "CAT LAKE, Ont. – Nishnawbe Aski Police Service have arrested two people in connection with a suspected July 2024 arson that tore through about $500,000 worth of construction materials.",
                "Police said the fire occurred on July 14 in the 100 block of Back Road, and upon arrival at the scene, they found warehouse fully engulfed in flames.",
                "Police assisted contractors to put out the fire, but it wasn’t in time to save the construction materials, which were destined to be used to build homes in the housing-challenged community.",
                "As a result, two suspects were eventually identified.",
                "A 19-year-old female and a 14-year-old female from Cat Lake First Nation have been charged with arson, damage to property.",
                "Police did not name the 19-year-old out of concern it might unintentionally identify the 14-year-old, who cannot be named under the Youth Criminal Justice Act.",
                "Both the accused have been released from custody with conditions and face future court appearance dates."
              ]
            }
        }

    ],
    "InternationalArticles": [
        {
            "title": "Air quality in several US states threatened by growing Canada wildfires: See map",
            "image": "https://www.usatoday.com/gcdn/authoring/authoring-images/2024/05/14/USAT/73688268007-page-1.jpeg?width=660&height=372&fit=crop&format=pjpg&auto=webp",
            "imageDescription": "Smoke rising from a wildfire in Alberta, Canada.",
            "author": "Julia Gomez",
            "publisher": "USA Today",
            "link": "https://www.usatoday.com/story/news/nation/2024/05/15/canadian-wildfires-2024-map-us-air-quality/73688440007/",
            "date": "2024-06-25",
            "content": {
              "paragraphs": [
                "Canadian wildfires triggered air quality alerts in Montana, North Dakota, South Dakota, Minnesota, parts of Wisconsin and Iowa Sunday and Monday, and experts say there won't be much improvement in the coming months as more states could possibly be affected this summer.",
                "\"I do expect more air quality issues,\" said Paul Pastelok, a senior meteorologist and U.S. long-range forecaster at AccuWeather. \"There'll be breaks, but the breaks will be few and in between at times in areas that are being affected even now.\"",
                "According to Pastelok, the fires could keep burning until September or October. However, predicting when it will improve is difficult.",
                "\"Predicting if the air quality will improve or worsen can be difficult because of the unpredictable behavior of wildfires and factors such as wind, weather, and terrain,\" said the Environmental Protection Agency's Office of Media Relations and Risk Communications in a statement sent to USA TODAY. \"For example, a wind that usually clears out a valley could also blow more smoke in or fan the flames, intensifying the fire and worsening smoke.\"",
                "According to Pastelok, weather patterns are still \"very active\" in the regions being affected by the smoke, and that will help improve the quality of air, but it can change.",
                "Like the EPA, Pastelok said the same system that can help improve air quality could also blow smoke back into the U.S.",
                "\"So it's good and bad,\" said Pastelok. \"It can clear for a little bit and then pick back up again on the backside of it.\"",
                "The following states saw air quality alerts:",
                "Iowa: Monday morning, parts of the state saw air quality drop to the 'unhealthy' range, reports WHO 13.",
                "Minnesota: Saw air quality alerts from Sunday to Monday night, according to a press release.",
                "Montana: Air quality dropped on Monday, but saw improvement later in the day as surface winds began to shift, states a different press release from Montana's Department of Environmental Quality.",
                "North Dakota: The state was put on alert Monday as smoke from the neighboring country impacted the air.",
                "South Dakota: On Monday, South Dakota announced the alert that would stay in effect until Tuesday. It stated that the smoke could cause low visibility and increased fine particulate matter, in a press release.",
                "Wisconsin: Parts of Wisconsin were placed on an air quality advisory on Monday, which was set to end at midnight the same day, according to previous reporting from USA TODAY.",
                "Pastelok said the smoke could get much worse going into June and July if fires start to grow.",
                "Alberta, British Columbia, and parts of Manitoba, Ontario and Southern Ontario are \"pretty dry,\" he said. So, if fires do grow in those areas, the Great Lakes area and parts of the far northeastern U.S. could be affected.",
                "The wildfire season is more active than usual because of the lack of snow depth and Canada's drought situation. Because of that, \"there'll be a lot of smoke in the air across Canada, and it doesn't take much to pull that smoke down. So I think we're still looking at problems here through the summer, in the northern tier in the nation, especially,\" said Pastelok.",
                "However, the meteorologist doesn't believe things will be as bad as they were last year.",
                "Wildfire smoke can irritate one's eyes, nose, and throat and cause:",
                "Coughing",
                "Chest tightness",
                "Shortness of breath",
                "Dizziness",
                "Fatigue",
                "Particulate matter, a type of air pollutant that is made of small particles of solids or liquids that are suspended in the air, is one of the main components of wildfire smoke, as USA TODAY previously reported.",
                "According to Yale Medicine, the particles can be 10 micrometers, PM 10, or as small as 2.5 micrometers, PM 2.5, and the smaller one poses a lot of health risks.",
                "PM2.5 is so tiny it can easily pass people's usual defense mechanisms and dive deep into their lungs. Not only can it damage lung function, but it can also pass into the bloodstream and travel to other organs.",
                "The following is linked to exposure to the PM 2.5:",
                "Heart attack",
                "Stroke",
                "Lung cancer",
                "Decline in cognitive function",
                "Wearing masks can protect one's lungs.",
                "\"I think you should have masks handy if you have conditions, especially if you're very sensitive to bad air quality,\" said Pastelok.",
                "The meteorologist says it's better to get masks early so stores won't be out of stock when more people need them.",
                "\"Make sure you're buying them ahead of time here because you never know when the stores might run out,\" he said.",
                "He adds that folks should be paying attention to weather alerts and checking air quality.",
                "\"I recommend people look at that closely,\" advised Pastelok. \"Especially in the northern tier, northern plains states, upper midwest, upper Great Lakes and far northern Northeast.\"",
                "He adds that people should have an air purifier handy if they can afford it and to make sure their AC and ventilation systems are working before the smoke reaches them or their air quality decreases.",
                "\"Make sure they're working efficiently because you can't open the windows up because that will bring everything inside,\" said Pastelok."
              ]
            }
        },
        {
            "title": "Record emissions from wildfires across the Americas in 2024",
            "image": "https://i0.wp.com/wildfiretoday.com/wp-content/uploads/2024/08/cams.png?resize=900%2C500&ssl=1",
            "author": "Hunter Bassler",
            "publisher": "Wildfire Today",
            "link": "https://wildfiretoday.com/2024/08/05/record-emissions-from-wildfires-across-the-americas-in-2024/",
            "date": "2024-08-05",
            "content": {
              "paragraphs": [
                "Wildfires in regions across North and South America released more emissions in July than any other July in recorded history — specifically in Alberta, California, Bolivia, and the tropical forest zone of the Amazon River basin — according to the European Union’s Copernicus Atmosphere Monitoring Service (CAMS).",
                "“CAMS estimates emissions from wildfires and vegetation fires around the world based on satellite observations of fire radiative power in its Global Fire Assimilation System (GFAS), combining FRP observations from different satellite sensors to estimate a number of emissions related to wildfires,” according to the Service.",
                "Alberta’s total estimated carbon emissions in July are the highest of any July in the CAMS Global Fire Assimilation System dataset, which has recorded emissions for the past 21 years. Canada as a whole recorded increased emissions through July and is approaching the highest annual totals estimated for any year before 2023, which had by far the highest emissions ever recorded in the country. Fire intensity in British Columbia and Saskatchewan has also increased throughout July, while more wildfires developed in the Yukon and Northwest Territories in mid-July.",
                "California’s Park Fire, the state’s fourth-largest wildfire on record, made July the most emissions-heavy July on CAMS’ record. Oregon’s emissions are near the highest of July totals after fires burned nearly 500,000 hectares (1,235,527 acres) across the state, which local officials say is four times the seasonal average. Notable fires and emissions in Alaska persisted through late June and early July, but have since greatly reduced. CAMS has also recorded increased wildfire emissions in Washington, Montana, and Colorado.",
                "Wildfires in South America increased in both intensity and frequency through the second half of July. Amazonas’ total estimated emissions in July were much higher than any other recorded year — three times higher than in 2023 and 2022. The neighboring state of Rondonia also recorded the highest in the CAMS dataset.",
                "South America’s highest wildfire activity was in Bolivia and areas of the Brazilian Amazon. Bolivian government officials said a record 11,576 active fires burned in the region on July 24, with 165,999 fires detected since the start of July. Brazilian authorities also estimated this was the worst July in two decades with more than 22,000 active wildfires. Wildfire increases occurred around two weeks earlier than usual during fire season in the region, which historically has peaked in August and September.",
                "Brazil’s above-average emissions are caused in part by wildfires burning across the Pantanal wetlands. The world’s largest tropical wetland and biodiversity haven has marked record-breaking wildfires this year, just four years after similar fires burned 13,300 acres of the preserve."
              ]
            }
        },
        {
            "title": "Man accused of starting California’s Park Fire is arrested as Oregon battles massive blaze",
            "image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-07-25t080150z-1713562494-rc2729axj5gl-rtrmadp-3-usa-wildfires.jpg?q=w_1110,c_fill/f_webp",
            "imageDescription": "Firefighters work as the Park Fire burns near Chico, California.",
            "author": "Dalia Faheid, Robert Shackelford, Lauren Mascarenhas, Cheri Mossburg",
            "publisher": "CNN",
            "link": "https://www.cnn.com/2024/07/25/us/durkee-fire-oregon/index.html",
            "date": "2024-07-25",
            "content": {
              "paragraphs": [
                "The largest active wildfire in the United States has scorched almost 270,000 acres in eastern Oregon, as nearly 80 large active wildfires are burning in the US, including a California blaze that exploded in size overnight. Here’s the latest:",
                "• California battles northern blaze: The Park Fire in California has exploded to nearly 125,000 acres and is 3% contained, according to CalFire. A suspect has been arrested after being identified pushing a car engulfed in fire 60 feet into a gully, 'spreading flames that caused the Park Fire,' the Butte County District Attorney’s Office announced Thursday afternoon. The blaze has forced mandatory evacuations in Butte County, where the state’s deadliest wildfire, the Camp Fire, killed more than 80 people in 2018.",
                "• Oregon fire is 20% contained: The Durkee Fire, which has burned an area larger than the city of Indianapolis, started on July 17 near the Oregon-Idaho state line. Amid high temperatures, extremely dry vegetation, and strong winds, the fire has grown tens of thousands of acres since Sunday and is 20% contained as of Thursday afternoon, according to InciWeb.",
                "• Durkee Fire threatens nearby communities: Three people were injured, and two homes and 12 other structures were destroyed as the fire spread, according to the Oregon Department of Emergency Management. Officials have asked some residents to evacuate. Some communities do not have power, according to Oregon Gov. Tina Kotek, who has deployed resources from the National Guard to assist.",
                "• Two fires threaten national park in Canada: The flames closing in on the nation’s largest national park from two directions sent visitors and residents fleeing the town of Jasper in Alberta, where buildings are burned. Officials say the losses are significant, and Prime Minister Justin Trudeau has deployed federal support to help battle the blaze.",
                "A 42-year-old man, identified as Ronnie Dean Stout II, has been arrested after witnesses reported seeing someone 'pushing a car that was on fire into a gully near the Alligator Hole in upper Bidwell Park shortly before 3:00 p.m. yesterday,' according to Butte County District Attorney Mike Ramsey. 'The car went down an embankment approximately 60 feet and burned completely, spreading flames that caused the Park Fire.'",
                "The DA says the man was seen 'calmly leaving the area by blending in with the other citizens who were in the area and fleeing the rapidly evolving fire.'",
                "Stout was arrested at a mobile home park in Chico, California, around 2 a.m., Ramsey said.",
                "He has two previous strikes in California, including a 2001 conviction in Butte County for lewd acts on a child under 14, and another in 2002 in Kern County for robbery with great bodily injury, when he was sentenced to 20 years in prison, Ramsey added. In California, people with two prior strikes – convictions of violent or serious felonies – receive significantly longer prison sentences if convicted of a third felony.",
                "Prison records were not immediately available but CNN reached out to the California Department of Corrections and Rehabilitation for more information.",
                "The suspect is being held without bail pending his arraignment, which is set for Monday, according to the DA’s office.",
                "Stout will likely face an arson charge, though it is unclear what count, or whether any enhancements will be added, Ramsey said. The DA’s office told CNN Stout has not retained an attorney and will be assigned a public defender at his arraignment.",
                "Triple-digit temperatures and high wind gusts have fueled the fire’s growth.",
                "Some residents in Butte County were asked to evacuate, as the fire grew to nearly 40,000 acres overnight to an area roughly the size of Washington, DC. By Thursday morning, the fire had burned an average of nearly 50 football fields per minute since it started Wednesday afternoon. Triple-digit temperatures and high wind gusts have fueled its growth.",
                "There are more than 200 firefighters deployed to fight the blaze, according to CalFire.",
                "Oregon fires ‘scaled up quickly’: The lightning-sparked Durkee Fire is the largest of 31 large wildfires currently burning across Oregon, which has been the hardest hit by fires in recent days.",
                "Officials in eastern Oregon’s Malheur County and Baker County had issued evacuations for areas around the Durkee Fire since its beginning.",
                "However, as of Thursday afternoon, all evacuation recommendations for the Durkee Fire in Malheur County have been lifted, said the Malheur County Sheriff’s Office in a social media post. As for Baker County, many areas’ evacuation levels have been reduced or eliminated, according to the county’s Sheriff’s Office.",
                "Dense smoke from the flames have impeded traffic on Interstate 84, leading to periodic closure of the freeway.",
                "Kotek called it a 'dynamic situation.'",
                "'The wildfires in Eastern Oregon have scaled up quickly,' Kotek said in a news release. 'We are facing strong erratic winds over the region that could impact all fires. Rain is not getting through. Some communities do not have power.'",
                "More than 500 firefighters and resources from 22 states are working to fight the fire, according to InciWeb.",
                "'We have been at this for a number of days, and those days just seem to keep getting harder and harder with the weather that we’re seeing in our area and the intense fire behavior,' Sarah Sherman of the Bureau of Land Management said in a video update.",
                "Over the weekend and earlier this week, the Durkee Fire exhibited extreme fire behavior, even creating its own weather in the form of pyrocumulus clouds.",
                "The clouds form over heat sources due to the intense, upward vertical motion of air cooling and condensing as it moves higher into the sky. They can reach heights of 50,000 feet and generate their own systems of thunderstorms.",
                "If fires burn hot enough, they can create clouds that produce lightning and rain, called pyrocumulonimbus.",
                "'Over the last week, firefighters have been challenged by hot temperatures and gusty winds that continue to push several wildfires across the state,' the Oregon State Fire Marshal said.",
                "Wildfire smoke, including from the Durkee Fire in Oregon, was spreading into Boise and beyond. Air quality alerts have been issued for parts of Colorado, Idaho, Oregon, and Washington.",
                "Patrick Nauman, the owner of Weiser Classic Candy in the small town of Weiser, Idaho, told the Associated Press that driving into town Wednesday morning was 'like driving into a fog bank, because it’s so thick and low to the road.'",
                "'Yesterday you could smell it, taste it, it just kind of hung in the back of your throat,' Nauman said of the smoke.",
                "A cold front has moved through the area Thursday morning, bringing high temperatures to the 80s on Thursday, according to the National Weather Service. A red flag warning, which indicates increased risk of fire danger, has expired.",
                "CNN Meteorologist Taylor Ward contributed to this report."
              ]
            }
        },
        {
            "title": "Thirteen arrested after fireworks from yacht spark forest fire on Greek island",
            "author": "Agence France-Presse",
            "publisher": "The Guardian",
            "link": "https://www.aljazeera.com/news/2024/7/24/canadian-wildfires-prompt-more-evacuation-orders-air-quality-warnings",
            "date": "2024-06-22",
            "content": {
              "paragraphs": [
                "Greek authorities arrested 13 people on Saturday after fireworks launched from a yacht set off a forest fire on an island near Athens as the country confronts a new season of deadly summer fires.",
                "The mayor of the island of Hydra expressed “outrage” after the fire was started late on Friday and vowed legal action against those responsible.",
                "Dozens of wildfires in Greece this week have left at least one person dead.",
                "The latest blaze was “caused by fireworks launched from a boat and burned the only pine forest on the island in a place that is difficult to access and has no road”, Hydra’s firefighting team said on Facebook.",
                "Thirteen people accused of involvement in the fireworks have been arrested after a fire service inquiry and will be presented before a prosecutor on Sunday, said a fire service statement.",
                "No details on the suspects were given. Greece has toughened its penalties for arson, with perpetrators now facing up to 20 years in prison and fines of up to 200,000 euros (£169,000).",
                "On top of calling for legal action against the “irresponsible” people behind the fireworks, Hydra’s mayor Giorgos Koukoudakis told the ERT public broadcaster that authorities had to create more anti-fire zones and roads through forests.",
                "Another fire raged on Saturday on the island of Andros, emergency services said. Four villages were evacuated and planes and helicopters were brought in to water-bomb the flames.",
                "The civil protection service called for extreme vigilance because the risk of fires was “very high”, particularly in the Attica region, the Peloponnese peninsula and in central Greece.",
                "Greece has been bracing for a difficult summer as authorities warn that strong winds and high temperatures have increased the danger.",
                "After its warmest winter ever, the Mediterranean country recorded its first heatwave of the year last week, with temperatures rising above 44C (111F) in some locations.",
                "Firefighters on Friday battled wildfires fanned by three days of fierce winds that left at least one person dead, a 55-year-old man who collapsed and died while fighting flames around his village.",
                "Last year, a fierce two-week heatwave was followed by devastating wildfires in which 20 people died.",
                "Scientists warn that fossil fuel emissions caused by humans are worsening the length and intensity of heatwaves around the world.",
                "Rising temperatures are leading to extended wildfire seasons and increasing the area burned by the blazes, according to the UN Intergovernmental Panel on Climate Change."
              ]
            }
        }
    ]
  }